# Movies Tonight Part 4: A few SELECT queries 
__Use `%%sql` magic to write the queries listed below.__

In [1]:
# load %sql magic extension
%load_ext sql

# initialize a database connection; may have to adjust username and password 
%sql sqlite:///Movies.db

'Connected: @Movies.db'

**1. Write a select query that returns the MovieTitle, TheaterName, and Showtime for each movie showing.**  
The query should use `JOIN` syntax as described in your textbook. Also, use aliases ( `… AS …` ) to make sure that column names match exactly what is asked for.

In [2]:
%%sql

SELECT DISTINCT MOVIES.TITLE AS MovieTitle, THEATERS.NAME as TheaterName, SHOWS.SHOWTIME as Showtime
FROM SHOWS
    JOIN THEATERS USING (TID)
    JOIN MOVIES USING (MID);

 * sqlite:///Movies.db
Done.

[]

**2. Write a select query to display the MovieTitle, TheaterName, and Showtime for each show after 7pm.** You can start with a copy of the previous query and then add a `WHERE` clause.

Lookup sqlite.org manual for datetime format!

In [3]:
%%sql

SELECT DISTINCT MOVIES.TITLE AS MovieTitle, THEATERS.NAME as TheaterName, SHOWS.SHOWTIME as Showtime
FROM Shows
    JOIN Theaters USING (TID)
    JOIN Movies USING (MID)
WHERE ShowTime > '07:00:00';

 * sqlite:///Movies.db
Done.

[]

**3. Write a select query to display the cast (actors only) of each movie.** The query should return the Movie Title, Actor Name, MID, and AID.

In [4]:
%%sql

SELECT DISTINCT MOVIES.MID, MOVIES.TITLE, ARTISTS.AID, ARTISTS.NAME 
FROM Movies
    JOIN Credit USING (MID)
    JOIN Artists USING (AID)
WHERE CREDIT.CCODE = "A"
LIMIT 10;

 * sqlite:///Movies.db
Done.

[]

**4. Write a select query to display the number of distinct movies that each actor appears in.** The query should return the ActorName, MovieCount, and AID. You will need to use use a GROUP BY clause and the COUNT() function.

In [5]:
%%sql

SELECT ARTISTS.AID, ARTISTS.NAME as ActorName, COUNT(DISTINCT MID) as MovieCount
FROM Movies
    JOIN Credit USING (MID)
    JOIN Artists USING (AID)
WHERE CREDIT.CCODE = "A"
GROUP BY ARTISTS.AID, ARTISTS.NAME
LIMIT 10;

 * sqlite:///Movies.db
Done.

[]

**5. Write a select query to display only the actors that appear in multiple movies.** The query should return the Actor Name, Movie Count, and AID. You can use the previous select query as a starting point. You will need to add a HAVING clause to do the restriction.

In [6]:
%%sql

SELECT ARTISTS.AID, ARTISTS.NAME as ActorName, COUNT(DISTINCT MID) as MovieCount
FROM Movies
    JOIN Credit USING (MID)
    JOIN Artists USING (AID)
WHERE CREDIT.CCODE = "A"
GROUP BY ARTISTS.AID, ARTISTS.NAME
HAVING MovieCount > 1;

 * sqlite:///Movies.db
Done.

[]

**6. Write a select query to display directors that also act in their movies.** The query should return the ArtistName, NumDirectorCredits, NumActorCredits, NumDirectorActorCredits. Each count should be calculated separately using a subquery. Note: NumDirectorActorCredits should be greater than 0.

In [7]:
%%sql

SELECT ARTISTS.NAME as ArtistName, MOVIES.TITLE, COUNT(CCODE) as NumCCODES
FROM Artists
    JOIN Credit USING (AID)
    JOIN Movies USING (MID)
WHERE Artists.Name = 'Stanley Tucci'
GROUP BY ARTISTS.AID, MOVIES.MID, ARTISTS.NAME, MOVIES.TITLE;

 * sqlite:///Movies.db
Done.

[]

### Another way! (Join a table with itself!)
    The following code looks for actors AND directors (using a cross join)

In [8]:
%%sql

SELECT Artists.Name as ArtistName, MOVIES.TITLE, c1.CCODE as c1code, c2.CCODE as c2code
FROM CREDIT as c1
    JOIN CREDIT as c2 USING (AID, MID)
    JOIN Artists USING (AID)
    JOIN Movies USING (MID)
WHERE c1code = 'A' and c2code = 'D';

 * sqlite:///Movies.db
Done.

[]

In [9]:
%%sql
SELECT * FROM sqlite_master;

 * sqlite:///Movies.db
Done.

[('table', 'Theaters', 'Theaters', 2, 'CREATE TABLE Theaters (\n    TID INTEGER PRIMARY KEY, \n    Name TEXT NOT NULL,\n    Location TEXT NOT NULL, \n    Phone TEXT NOT NULL\n)'),
 ('table', 'Movies', 'Movies', 3, 'CREATE TABLE Movies (\n    MID INTEGER PRIMARY KEY,\n    Title TEXT NOT NULL,\n    Rating TEXT\n)'),
 ('table', 'Artists', 'Artists', 4, 'CREATE TABLE Artists (\n    AID INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL,\n    Bio TEXT,\n    Headshot BLOB\n)'),
 ('table', 'Shows', 'Shows', 5, 'CREATE TABLE Shows (\n    SID INTEGER PRIMARY KEY, \n    ShowTime TEXT NOT NULL,\n    MID INTEGER NOT NULL, \n    TID INTEGER NOT NULL,\n    FOREIGN KEY (TID) REFERENCES TheaterS(TID),\n    FOREIGN KEY (MID) REFERENCES Movies(MID)\n)'),
 ('table', 'Credit', 'Credit', 6, 'CREATE TABLE Credit (\n    CID INTEGER PRIMARY KEY, \n    AID INTEGER NOT NULL,\n    MID INTEGER NOT NULL,\n    CCode TEXT NOT NULL,\n    FOREIGN KEY (AID) REFERENCES Artist(AID),\n    FOREIGN KEY (MID) REFERENCES Movies(MID)\n)')]